app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "content", "published_at", "password") VALUES('2010-02-21 18:59:20', 'Brazil', '2010-02-21 18:59:20', 'Pee in the shower.', '2010-02-21 18:50:00', NULL)

  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2010-02-21 19:43:49', "content" = '<p>